results/data/run4/jvm-db/erik-laptop/quarkus-worker-pool-5000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/fruits
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.332ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.344ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.331ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.736ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.40ms  503.21us   4.56ms   67.38%
    Req/Sec     1.32k   634.66     2.78k    77.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.34ms
 75.000%    1.70ms
 90.000%    2.12ms
 99.000%    2.71ms
 99.900%    3.30ms
 99.990%    4.06ms
 99.999%    4.49ms
100.000%    4.57ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.419     0.000000            1         1.00
       0.793     0.100000        25043         1.11
       0.948     0.200000        49894         1.25
       1.087     0.300000        74837         1.43
       1.214     0.400000        99747         1.67
       1.338     0.500000       124864         2.00
       1.402     0.550000       137236         2.22
       1.470     0.600000       149741         2.50
       1.539     0.650000       162139         2.86
       1.618     0.700000       174657         3.33
       1.704     0.750000       187037         4.00
       1.752     0.775000       193302         4.44
       1.806     0.800000       199559         5.00
       1.868     0.825000       205782         5.71
       1.938     0.850000       211953         6.67
       2.020     0.875000       218212         8.00
       2.065     0.887500       221343         8.89
       2.115     0.900000       224470        10.00
       2.171     0.912500       227637        11.43
       2.227     0.925000       230712        13.33
       2.287     0.937500       233777        16.00
       2.321     0.943750       235417        17.78
       2.355     0.950000       236964        20.00
       2.391     0.956250       238499        22.86
       2.431     0.962500       240081        26.67
       2.475     0.968750       241588        32.00
       2.499     0.971875       242404        35.56
       2.525     0.975000       243161        40.00
       2.555     0.978125       243952        45.71
       2.587     0.981250       244702        53.33
       2.625     0.984375       245490        64.00
       2.645     0.985938       245864        71.11
       2.669     0.987500       246263        80.00
       2.697     0.989062       246648        91.43
       2.729     0.990625       247021       106.67
       2.767     0.992188       247416       128.00
       2.791     0.992969       247610       142.22
       2.815     0.993750       247811       160.00
       2.843     0.994531       247998       182.86
       2.873     0.995313       248186       213.33
       2.911     0.996094       248380       256.00
       2.933     0.996484       248478       284.44
       2.965     0.996875       248589       320.00
       2.997     0.997266       248673       365.71
       3.041     0.997656       248773       426.67
       3.091     0.998047       248867       512.00
       3.129     0.998242       248919       568.89
       3.161     0.998437       248965       640.00
       3.205     0.998633       249014       731.43
       3.251     0.998828       249063       853.33
       3.315     0.999023       249111      1024.00
       3.355     0.999121       249137      1137.78
       3.383     0.999219       249160      1280.00
       3.419     0.999316       249184      1462.86
       3.471     0.999414       249208      1706.67
       3.577     0.999512       249233      2048.00
       3.633     0.999561       249245      2275.56
       3.649     0.999609       249257      2560.00
       3.691     0.999658       249269      2925.71
       3.725     0.999707       249281      3413.33
       3.791     0.999756       249294      4096.00
       3.813     0.999780       249300      4551.11
       3.851     0.999805       249306      5120.00
       3.891     0.999829       249313      5851.43
       3.949     0.999854       249319      6826.67
       3.991     0.999878       249324      8192.00
       4.029     0.999890       249327      9102.22
       4.065     0.999902       249330     10240.00
       4.139     0.999915       249333     11702.86
       4.147     0.999927       249336     13653.33
       4.175     0.999939       249340     16384.00
       4.239     0.999945       249341     18204.44
       4.263     0.999951       249342     20480.00
       4.287     0.999957       249344     23405.71
       4.299     0.999963       249346     27306.67
       4.363     0.999969       249347     32768.00
       4.367     0.999973       249348     36408.89
       4.367     0.999976       249348     40960.00
       4.431     0.999979       249349     46811.43
       4.487     0.999982       249351     54613.33
       4.487     0.999985       249351     65536.00
       4.487     0.999986       249351     72817.78
       4.487     0.999988       249351     81920.00
       4.495     0.999989       249352     93622.86
       4.495     0.999991       249352    109226.67
       4.527     0.999992       249353    131072.00
       4.527     0.999993       249353    145635.56
       4.527     0.999994       249353    163840.00
       4.527     0.999995       249353    187245.71
       4.527     0.999995       249353    218453.33
       4.567     0.999996       249354    262144.00
       4.567     1.000000       249354          inf
#[Mean    =        1.401, StdDeviation   =        0.503]
#[Max     =        4.564, Total count    =       249354]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  298570 requests in 1.00m, 48.41MB read
Requests/sec:   4975.99
Transfer/sec:    826.09KB